---
kind: type
id: T:Autodesk.Revit.DB.IPrintSetting
source: html/fec3af2e-1c5d-8a84-6bf3-37f1d2633007.htm
---
# Autodesk.Revit.DB.IPrintSetting

An interface which represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.

## Syntax (C#)
```csharp
public interface IPrintSetting
```